<template>
  <div>
    <div class="parent-container">
      <h2><p>당신과 어울리는 직업 유형은?</p></h2>
    </div>
    <div class="parent-container">
      <h2 class="fontStyle">
        <p>{{ type.typeName }}</p>
      </h2>
    </div>
    <div>
      <img :src="type.imgName" alt="animal" class="animal-image" />
    </div>
    <div class="info-box">
      <h3>
        <p style="text-align: left">{{ type.typeName }} 유형 결과 해석</p>
      </h3>
      <p style="text-align: left">{{ type.result }}</p>
      <br /><br />

      <p class="content-header">추천직업 :</p>
      <p style="text-align: left">{{ type.jobList }}</p>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      type: {
        typeName: "호기심 많은 고양이",
        result:
          "이 유형은 끊임없는 호기심과 탐구적인 마인드를 가지고 있습니다. 새로운 아이디어와 개념에 대해 항상 열린 태도를 가지며, 예상치 못한 상황에서도 창의적인 해결책을 제시하는 능력이 뛰어납니다. 이러한 개인은 지적 자극과 새로운 지식을 추구하며, 미지의 영역을 탐험하는 것을 즐깁니다. 이들은 변화에 민감하고, 다양한 관점에서 사물을 바라볼 수 있어, 복잡한 문제를 해결하는데 탁월한 능력을 보입니다.",
        imgName: require("@/assets/cat.png"),
        jobList: "과학자, 마케터, 개발자, 데이터 사이언티스트, 작가",
      },
    };
  },
  props: {
    jobType: {
      type: String,
      default: "",
    },
  },
  mounted() {
    this.resultMethods();
  },
  methods: {
    resultMethods() {
      if (this.jobType === "AAAA") {
        //호기심 많은 고양이
        this.type["typeName"] = "호기심 많은 고양이";
        //this.type["result"] = "이 유형은 끊임없는 호기심과 탐구적인 마인드를 가지고 있습니다. 새로운 아이디어와 개념에 대해 항상 열린 태도를 가지며, 예상치 못한 상황에서도 창의적인 해결책을 제시하는 능력이 뛰어납니다. 이러한 개인은 지적 자극과 새로운 지식을 추구하며, 미지의 영역을 탐험하는 것을 즐깁니다. 이들은 변화에 민감하고, 다양한 관점에서 사물을 바라볼 수 있어, 복잡한 문제를 해결하는데 탁월한 능력을 보입니다.";
        this.type["result"] = "이 유형의 사람들은 항상 새로운 것에 대한 궁금증을 가지고 있어요. 그들은 새로운 아이디어와 개념에 대해 마음을 열고 있으며, 예기치 않은 상황에서도 창의적인 해결책을 찾아내는 재능이 있죠. 지적인 자극과 새로운 지식을 찾아 나서는 것을 좋아하며, 아직 알려지지 않은 것들을 발견하는 것에 큰 흥미를 보입니다. 이러한 사람들은 변화에 민감하게 반응하고, 다양한 시각에서 문제를 바라볼 수 있는 능력이 있어 복잡한 문제를 해결하는 데에도 뛰어납니다.";
        this.type["imgName"] = require("@/assets/cat.png");
        this.type["jobList"] =
          "과학자, 마케터, 개발자, 데이터 사이언티스트, 작가";
        document.body.style.backgroundColor = "#E6E6FA";
      } else if (this.jobType === "AAAB") {
        this.type["typeName"] = "유연한 개구리";
        //this.type["result"] = "이 유형의 사람들은 변화에 매우 유연하며 적응력이 뛰어납니다. 새로운 상황과 도전에 쉽게 적응하며, 스트레스가 많은 환경에서도 침착함을 유지합니다. 이들은 다양한 상황을 잘 관리하고, 갑작스러운 문제에 대해 즉각적이고 창의적인 해결책을 찾아내는 경향이 있습니다. 또한, 다른 사람들과의 관계에서도 유연하게 대처하며, 상호작용에 있어서 긍정적이고 조화로운 태도를 보입니다.";
        this.type["result"] = "이 유형의 사람들은 변화에 정말 잘 적응해요. 새로운 상황이나 도전에 직면할 때도 금방 적응하며, 스트레스가 많은 상황에서도 침착함을 잃지 않죠. 어떤 상황이든 잘 다루고, 갑작스럽게 발생하는 문제에 대해서도 바로 창의적인 해결책을 찾아내는 능력이 있어요. 게다가, 다른 사람들과의 소통에서도 유연하게 대응하며, 다른 이들과의 대화와 관계에서 긍정적이고 조화로운 태도를 보여줍니다.";
        this.type["imgName"] = require("@/assets/frog.png");
        this.type["jobList"] =
          "강사 , 인사담당자, 심리상담사, CS 담당자";
        document.body.style.backgroundColor = "#98FF98";
      } else if (this.jobType === "AABA") {
        this.type["typeName"] = "정리에 진심인 다람쥐";
        //this.type["result"] = "이 유형은 매우 체계적이고 조직적입니다. 세부 사항에 집중하며, 계획과 질서를 중시합니다. 이들은 일을 체계적으로 관리하고, 목표를 설정하며 이를 달성하기 위한 구체적인 계획을 세웁니다. 높은 수준의 집중력과 꼼꼼함으로 복잡한 정보를 잘 다루며, 장기적인 프로젝트 관리에 강점을 보입니다. 이 유형은 정확성과 효율성을 중요시하며, 질서 정연한 환경에서 최고의 성과를 냅니다.";
        this.type["result"] = "이 유형의 사람들은 모든 것을 정돈하고 계획하는 데 뛰어난 능력을 가지고 있어요. 그들은 일을 할 때 중요한 것부터 차례대로 처리하며, 각 단계를 철저히 관리합니다. 작은 세부 사항 하나하나에도 주의를 기울이는 것은 물론, 큰 그림을 보며 일의 전체적인 흐름을 이해하는 데도 능숙합니다. 이런 사람들은 일정을 정확하게 관리하고, 목표를 설정할 때 구체적이고 실현 가능한 계획을 세웁니다. 그들은 일을 진행함에 있어서 단계별로 체계적으로 접근하며, 각 과정을 체크하고 평가하는 것을 중요하게 여깁니다. 이렇게 체계적으로 접근하는 것은 복잡한 정보를 효율적으로 처리하고, 장기 프로젝트를 성공적으로 관리하는 데 큰 도움이 됩니다. 이들은 질서와 정확성을 중시하며, 체계적인 환경에서 최상의 성과를 발휘할 수 있습니다.";
        this.type["imgName"] = require("@/assets/squirrel.png");
        this.type["jobList"] =
          "재무 설계사 , 변호사 , 건축가, 시설관리사";
        document.body.style.backgroundColor = "#F5F5DC";
      } else if (this.jobType === "AABB") {
        this.type["typeName"] = "계획적인 코끼리";
        //this.type["result"] = "이 유형의 사람들은 복잡한 시스템이나 프로세스를 잘 이해하고, 그 안에서 최적의 해결책을 찾아내는 데 능숙합니다. 그들은 꼼꼼한 세부 사항에 주의를 기울이면서도, 전체적인 목표와 큰 그림을 놓치지 않습니다. 계획적인 개미 엔지니어는 모든 작업을 미리 계획하고, 이 계획에 따라 일관성 있게 행동하는 것을 선호합니다. 이러한 체계적 접근은 프로젝트 관리, 팀 리딩, 그리고 복잡한 과제 해결에서 큰 장점으로 작용합니다. 이들은 또한, 팀 내에서 업무의 흐름을 조율하고, 모든 구성원이 일정에 맞춰 효과적으로 업무를 수행할 수 있도록 돕는 데 중요한 역할을 합니다.";
        this.type["result"] = "이 유형의 사람들은 복잡한 문제나 업무를 쉽게 파악하고 이해하는 데 탁월한 능력을 가지고 있습니다. 그들은 문제의 핵심을 신속하게 파악하고, 효과적인 해결책을 찾는데 뛰어난 재능이 있어요. 이러한 능력은 프로젝트 관리, 분석적 사고, 그리고 전략적 계획 수립 등 여러 분야에서 큰 영향력을 발휘합니다. 이들은 복잡한 상황에서도 명확하고 체계적으로 생각할 수 있으며, 이를 바탕으로 어려운 상황을 잘 관리하고 해결합니다. 팀 내에서 문제 해결사로 인정받으며, 다른 사람들이 어려움을 겪을 때 해결 방안을 제시하는 데 큰 도움이 되죠. 그들의 분석적 접근과 체계적인 사고방식은 조직이 더 나은 결정을 내리고 성공적인 결과를 달성하는 데 크게 기여합니다.";
        this.type["imgName"] = require("@/assets/elephant.png");
        this.type["jobList"] =
          "통계학자, AI 개발자, 보안전문가, 경제학자";
        document.body.style.backgroundColor = "#707070";
      } else if (this.jobType === "ABAA") {
        this.type["typeName"] = "자유로운 돌고래";
        //this.type["result"] = "이 유형은 자유롭고 창의적인 사고를 선호합니다. 새롭고 다양한 아이디어를 즐기며, 전통적인 틀을 벗어난 접근을 추구합니다. 자유로운 나비는 유연하고 개방적인 사고방식을 가지고 있어, 새로운 환경과 변화에 잘 적응합니다. 이들은 종종 예술적 감각이 뛰어나며, 비전을 현실로 만드는 능력을 갖추고 있습니다.";
        this.type["result"] = "이 유형의 사람들은 자유롭고 창의적인 사고를 좋아합니다. 그들은 새롭고 다양한 아이디어를 즐기며, 전통적인 방식에서 벗어나 새로운 방법을 찾아내는 것을 선호해요. '자유로운 돌고래' 유형은 유연하고 개방적인 사고방식을 가지고 있어, 새로운 환경과 변화에 빠르게 적응합니다. 이들은 예술적 감각이 뛰어나며, 꿈이나 비전을 현실로 만드는 데에 특히 능숙합니다. 창의력을 발휘해 혁신적인 아이디어를 제안하고, 다른 사람들에게 새로운 시각을 제시하는 것이 이 유형의 사람들의 큰 장점입니다.";
        this.type["imgName"] = require("@/assets/dolphin.png");
        this.type["jobList"] =
          "디자이너, 화가, 작곡가, 아트디렉터";
        document.body.style.backgroundColor = "#87CEFA";
      } else if (this.jobType === "ABAB") {
        this.type["typeName"] = "시간 관리가 철저한 벌";
        //this.type["result"] = "이 유형은 높은 수준의 조직력과 시간 관리 능력을 갖추고 있습니다. 계획을 세우고, 업무를 체계적으로 관리하는 데 능숙합니다. 시간 관리가 철저한 벌은 효율성과 생산성을 중시하며, 목표 달성을 위해 체계적인 절차를 따르는 것을 선호합니다. 이들은 팀 내에서도 업무 진행 상황을 정리하고, 일정을 관리하는 중요한 역할을 합니다.";
        this.type["result"] = 
        "이 유형의 사람들은 탁월한 조직력과 시간 관리 능력을 지니고 있어요. 그들은 계획을 세우고 업무를 체계적으로 관리하는 데 능숙합니다. '시간 관리가 철저한 벌' 유형은 효율성과 생산성을 중요하게 생각하며, 목표를 달성하기 위해 체계적인 절차를 따르는 것을 선호합니다. 팀 내에서도 이들은 업무 진행 상황을 정리하고, 일정을 관리하는 중요한 역할을 담당합니다. 이런 능력은 과업을 원활하게 진행시키고, 팀이 목표를 효과적으로 달성하는 데 큰 도움이 됩니다.";
        this.type["imgName"] = require("@/assets/bee.png");
        this.type["jobList"] =
          "인사 담당자, 재무 설계사, CS관리자, 진로상담가, 도서관 사서";
        document.body.style.backgroundColor = "#FFFF00";
      } else if (this.jobType === "ABBA") {
        this.type["typeName"] = "질서 정연한 판다 사무관";
        //this.type["result"] = "이 유형은 질서와 규칙을 중시하는 성향을 가지고 있습니다. 체계적이고 꼼꼼한 접근 방식으로 일을 처리하며, 안정과 일관성을 중요하게 여깁니다. 질서 정연한 판다는 세부 사항에 주의를 기울이며, 정확하고 체계적인 업무 수행을 선호합니다. 이들은 안정적이고 예측 가능한 환경에서 최고의 성과를 냅니다.";
        this.type["result"] = "이 유형의 사람들은 질서와 규칙을 매우 중시합니다. 그들은 모든 일을 체계적이고 꼼꼼하게 처리하는 방식을 선호하며, 안정성과 일관된 방식의 중요성을 인식합니다. '질서 정연한 판다' 유형은 세부 사항에 주의를 기울이고, 정확하고 체계적인 방법으로 업무를 수행하는 것을 좋아합니다. 이러한 성향의 사람들은 안정적인 환경에서 최고의 퍼포먼스를 보여줍니다. 규칙과 절차에 따라 모든 일을 철저히 관리하는 데 능숙한 이들은 작업의 효율성과 정확도를 높이는 데 크게 기여합니다.";
  
        this.type["imgName"] = require("@/assets/panda.png");
        this.type["jobList"] =
          "회계사, 빅데이터 분석가, DBA, 보험 평가사";
        document.body.style.backgroundColor = "#A8A8A8";
      } else if (this.jobType === "ABBB") {
        this.type["typeName"] = "꼼꼼한 소라게";
        //this.type["result"] = "이 유형은 세부 사항에 대한 주의와 정밀한 작업을 선호합니다. 구조적인 사고와 철저한 계획으로 복잡한 프로젝트를 성공적으로 관리합니다. 꼼꼼한 비버는 자신의 업무에 매우 집중하며, 정교하고 정밀한 결과물을 만드는 데 탁월한 능력을 가지고 있습니다. 이들은 기술적이고 정밀한 작업을 선호하며, 장기적인 프로젝트에서도 꾸준한 집중력을 유지합니다.";
        this.type["result"] = "이 유형의 사람들은 작은 부분 하나하나에 주의를 기울이기 때문에, 세밀함과 정밀함을 요하는 직업을 선호합니다. 그들은 복잡한 작업을 성공적으로 관리하는 데 필요한 구조적 사고와 철저한 계획 능력을 갖추고 있습니다. '꼼꼼한 소라게' 유형은 자신의 업무에 매우 집중하며, 정교하고 정밀한 결과물을 만드는 데 탁월한 능력을 가지고 있습니다. 기술적이고 정밀한 작업을 선호하는 이들은 집중력도 오래 유지할 수 있는 장점을 가지고 있습니다.";
        this.type["imgName"] = require("@/assets/hermit-crab.png");
        this.type["jobList"] =
          "보석 세공사 , 건축가, 시계 수리공, 측량사";
        document.body.style.backgroundColor = "#A52A2A";
      } else if (this.jobType === "BAAA") {
        this.type["typeName"] = "모험을 즐기는 사자";
        //this.type["result"] = "이 유형은 모험적이고 적극적인 태도를 가지고 있습니다. 새롭고 도전적인 상황을 즐기며, 빠르게 변화하는 환경에서도 흥미를 느낍니다. 모험을 즐기는 여우는 리스크를 감수하고, 미지의 영역을 탐험하는 것을 두려워하지 않습니다. 이들은 창의적이고 혁신적인 사고를 가지고 있으며, 자신만의 독특한 방식으로 문제를 해결합니다.";
        this.type["result"] = "이 유형의 사람들은 모험적이고 적극적인 태도를 보여줍니다. 그들은 새로운 상황과 도전을 즐기며, 끊임없이 변화하는 환경에서도 흥미를 느낍니다. '모험을 즐기는 사자' 유형은 리스크를 감수하는 것을 두려워하지 않고, 알려지지 않은 영역을 탐험하는 것을 좋아합니다. 이들은 창의적이고 혁신적인 사고방식을 가지고 있으며, 자신만의 독특한 방법으로 문제를 해결합니다.";
        this.type["imgName"] = require("@/assets/lion.png");
        this.type["jobList"] =
          "여행가이드, 스포츠 트레이너, 심리 치료사, 패션디자이너, 등산가, 프로듀서";
        document.body.style.backgroundColor = "#FFA500";
      } else if (this.jobType === "BAAB") {
        this.type["typeName"] = "에너지 넘치는 강아지";
        //this.type["result"] = "이 유형은 활기차고 열정적입니다. 어떤 상황에서도 긍정적인 태도를 유지하며, 팀에 에너지를 불어넣습니다. 에너지 넘치는 강아지는 빠르게 행동하고, 즉각적인 결과를 추구하는 경향이 있습니다. 이들은 팀워크를 중시하며, 열정적으로 소통하고 협력합니다. 이러한 성향은 활발하고 역동적인 작업 환경에서 빛을 발합니다.";
        this.type["result"] = "이 유형의 사람들은 활기차고 열정적인 성격을 가지고 있습니다. 어떤 상황에서도 긍정적인 태도를 유지하며, 팀에 활력을 불어넣는 데 큰 역할을 합니다. '에너지 넘치는 강아지'  유형은 빠르게 행동하고 즉각적인 결과를 추구하는 경향이 있습니다. 팀워크를 중시하며, 열정적으로 소통하고 협력하는 것이 특징입니다. 이러한 성향은 활발하고 역동적인 작업 환경에서 특히 빛을 발합니다.";
        this.type["imgName"] = require("@/assets/puppy.png");
        this.type["jobList"] =
          "CS 매니저, 헬스 트레이너, 애니메이터, 마케터";
        document.body.style.backgroundColor = "#FF6347";
      } else if (this.jobType === "BABA") {
        this.type["typeName"] = "효율을 중시하는 상어";
        //this.type["result"] = "이 유형은 효율성과 목적 달성을 중시합니다. 전략적인 사고와 목표 지향적인 접근 방식을 가지고 있으며, 결과를 빠르게 달성하기 위한 최적의 경로를 찾아냅니다. 효율을 중시하는 매는 분석적이고 논리적인 사고를 가지고 있으며, 복잡한 상황에서도 핵심을 파악하는 능력이 뛰어납니다. 이들은 자원을 최적화하고, 시간과 노력을 효과적으로 관리합니다.";
        this.type["result"] = "이 유형의 사람들은 효율성과 목표 달성에 큰 중점을 둡니다. 그들은 전략적 사고와 목표 지향적인 접근 방식을 가지고 있으며, 결과를 신속하게 달성하기 위한 최적의 방법을 찾아내는 데 능숙합니다. '효율을 중시하는 상어' 유형은 분석적이고 논리적인 사고를 통해 복잡한 상황 속에서도 핵심을 파악하는 데 탁월한 능력을 보여줍니다. 자원을 최적화하고 시간과 노력을 효과적으로 관리하는 것이 이들의 특징입니다.";
        this.type["imgName"] = require("@/assets/shark.png");
        this.type["jobList"] =
          "데이터 사이언티스트, 인사 담당자, QA 전문가,  재무 설계사";
        document.body.style.backgroundColor = "#4682B4";
      } else if (this.jobType === "BABB") {
        this.type["typeName"] = "실용적인 말 기술자";
        //this.type["result"] = "이 유형은 실용적이고 현실적인 접근을 중시합니다. 구체적이고 현실적인 해결책을 찾으며, 실질적인 결과를 추구합니다. 실용적인 코뿔소는 복잡한 기술적 문제를 해결하는 데 능숙하며, 논리적이고 체계적인 사고를 통해 실제적인 솔루션을 제공합니다. 이들은 물리적인 작업이나 기술적인 작업에서 강점을 보이며, 구체적이고 실용적인 결과물을 만드는 데 탁월한 능력을 가지고 있습니다.";
        this.type["result"] = "이 유형의 사람들은 실용적이고 현실적인 접근을 선호합니다. 그들은 구체적이고 현실에 기반한 해결책을 찾으며, 실질적인 결과를 중요하게 여깁니다. '실용적인 말' 유형은 복잡한 기술적 문제를 해결하는 데 능숙하며, 논리적이고 체계적인 사고를 통해 실제적인 솔루션을 제공합니다. 물리적이거나 기술적인 작업에서 강점을 보이며, 구체적이고 실용적인 결과물을 만드는 데 탁월한 능력을 가지고 있습니다.";
        this.type["imgName"] = require("@/assets/horse.png");
        this.type["jobList"] =
          "자동차 엔지니어, 전기 기술자, 농부, 물리치료사";
        document.body.style.backgroundColor = "#B0C4DE";
      } else if (this.jobType === "BBAA") {
        this.type["typeName"] = "전문 지식을 가진 올빼미 교수";
        //this.type["result"] = "이 유형은 깊은 지식과 전문성을 추구합니다. 학문적 탐구와 지적 호기심이 높으며, 복잡한 개념을 이해하고 가르치는 데 뛰어난 능력을 보입니다. 전문 지식을 가진 올빼미는 연구와 분석에 강하며, 지식을 체계적으로 정리하고 전달하는 데 능숙합니다. 이들은 깊이 있는 사고와 고차원적인 문제 해결 능력을 가지고 있습니다.";
        this.type["result"] = "이 유형의 사람들은 깊은 지식과 전문성을 추구합니다. 그들은 학문적 탐구에 열정적이고 지적 호기심이 많으며, 복잡한 개념을 이해하고 가르치는 데 탁월한 능력을 가지고 있습니다. '전문 지식을 가진 올빼미' 유형은 연구와 분석에 강하며, 지식을 체계적으로 정리하고 전달하는 데 능숙합니다. 깊이 있는 사고와 고차원적인 문제 해결 능력을 가진 이들은 지식의 세계에서 두각을 나타냅니다.";
        this.type["imgName"] = require("@/assets/owl.png");
        this.type["jobList"] =
          "대학교수, 변호사, 의사, 과학자, 화장품 연구가";
        document.body.style.backgroundColor = "#00008B";
      } else if (this.jobType === "BBAB") {
        this.type["typeName"] = "체계적인 문어";
        //this.type["result"] = "이 유형은 체계적이고 구조적인 사고를 선호합니다. 복잡한 시스템이나 프로젝트를 효율적으로 관리하며, 세심한 계획과 정교한 디자인을 추구합니다. 체계적인 거미는 논리적이고 분석적인 접근으로 문제를 해결하며, 자신의 작업에 깊은 집중력을 보입니다. 이들은 정보를 체계적으로 정리하고, 구조화하는 데 능숙합니다.";
        this.type["result"] = "이 유형의 사람들은 체계적이고 구조적인 사고를 선호합니다. 그들은 복잡한 시스템이나 작업을 효율적으로 관리하며, 세심한 계획과 정교한 디자인을 추구합니다. '체계적인 문어' 유형은 논리적이고 분석적인 방법으로 문제를 해결하며, 자신의 작업에 깊은 집중력을 보입니다. 정보를 체계적으로 정리하고 구조화하는 데 능숙한 이들은 복잡한 상황에서도 명확한 해결책을 제시합니다.";
        this.type["imgName"] = require("@/assets/spider.png");
        this.type["jobList"] =
          "물리학자, 물리치료사, 마케터, 사회복지사, 간호사";
        document.body.style.backgroundColor = "#8A2BE2";
      } else if (this.jobType === "BBBA") {
        this.type["typeName"] = "안정을 추구하는 코알라";
        //this.type["result"] = "이 유형은 안정성과 일관성을 중시합니다. 예측 가능한 환경과 안정적인 작업 흐름을 선호하며, 규칙과 절차를 따르는 것에 편안함을 느낍니다. 안정을 추구하는 코알라는 신중하고 차분한 접근을 하며, 장기적인 관점에서 안정적인 결과를 추구합니다. 이들은 변동성이 적은 환경에서 꾸준한 성과를 보입니다.";
        this.type["result"] = "이 유형의 사람들은 안정성과 일관성을 매우 중요하게 여깁니다. 그들은 예측 가능한 환경과 안정적인 업무를 선호하며, 규칙과 절차를 따르는 데 편안함을 느낍니다. '안정을 추구하는 코알라' 유형은 신중하고 차분한 방식으로 접근하며, 장기적인 관점에서 안정적인 결과를 추구합니다. 변동성이 적은 환경에서 이들은 꾸준한 성과를 보여줍니다.";
        this.type["imgName"] = require("@/assets/koala.png");
        this.type["jobList"] =
          "공무원 , 은행원 , 사무직 , 비서";
        document.body.style.backgroundColor = "#D3D3D3";
      } else if (this.jobType === "BBBB") {
        this.type["typeName"] = "'새것 보단 옛것', 전통 사수 거북이";
        //this.type["result"] = "이 유형은 전통적이고 신중한 접근을 선호합니다. 검증된 방법과 경험에 기반하여 결정을 내리며, 변화보다는 일관성과 신뢰성을 중요시합니다. 전통을 중시하는 현자 거북이는 장기적이고 지속 가능한 솔루션을 추구하며, 신중하고 깊이 있는 사고를 통해 문제를 해결합니다. 이들은 신중한 계획과 심사숙고를 통해 결정을 내리는 경향이 있습니다.";
        this.type["result"] = "이 유형의 사람들은 전통적이고 신중한 접근을 선호합니다. 검증된 방법과 경험을 바탕으로 결정을 내리며, 변화보다는 일관성과 신뢰성을 더 중요하게 여깁니다. '전통 사수 거북이' 유형은 장기적이고 지속 가능한 해결책을 추구하며, 신중하고 깊이 있는 사고를 통해 문제를 해결합니다. 이들은 신중한 계획과 충분한 고려를 통해 결정을 내리는 경향이 있습니다.";
        this.type["imgName"] = require("@/assets/turtle.png");
        this.type["jobList"] =
          "부동산 중개사, 경찰관, 교사, 세무사";
        document.body.style.backgroundColor = "#013220";
      }

      document.body.style.backgroundColor = "#FFFFFF";
    },
  },
};
</script>
<style scoped>
.fontStyle {
  color: black;
}
.parent-container {
  /* 부모 컨테이너 클래스를 추가합니다. */
  display: flex;
  justify-content: center; /* 수평 중앙 정렬 */
}

.info-box {
  border: 1px solid #989dff; /* 테두리 */
  border-radius: 20px; /* 모서리 둥글게 */
  padding: 5%; /* 내부 여백 */
  margin: 5% 10%; /* 외부 여백 */
  background-color: #e0d9ff; /* 배경색 */
}
.content-header {
  text-align: left;
  font-weight: 900;
}
.content-substance {
  text-align: left;
}

.animal-image {
  width: 20%;
  height: 30%;
}
</style>
